/*******************************
 * 水仙花数(daffodil)
 * 输出100~999中的所有水仙花数  
 * 若3位数ABC满足 
 *   ABC = A^3 + B^3 + C^3
 * 则称其为水仙花数
 *
 * A = 1 B = 5 C = 3 153 = 1 + 125 + 27
 * A = 3 B = 7 C = 0 370 = 27 + 343 + 0
 * A = 3 B = 7 C = 1 371 = 27 + 343 + 1
 * A = 4 B = 0 C = 7 407 = 64 + 0 + 343
 * 
 * 注意 
 *   取余(%)的含义
 *   a % b = a - (a / b) * b
 *   999 % 10 = 999 - (999 / 10) * 10 = 999 - 99 * 10 = 9
 * ***************************/
# include<cstdio>

int main(){
    for(int i = 100; i < 999; i ++){
        /*
        int A = (i - i % 100) / 100;
        int B = (i - A * 100 - i % 10) / 10;
        int C = (i - A * 100 - B * 10);
        */
       int C = i % 10;
       int B = i / 10 % 10;
       int A = i / 100;

        int ABC = i;
        if(ABC == (A*A*A + B*B*B + C*C*C))
            printf("A = %d B = %d C = %d\n%d = %d + %d + %d\n\n", A, B, C, i, A*A*A, B*B*B, C*C*C);
    }

    getchar();
    return 0;
}