/***************************
 * 韩信点兵
 * 让士兵先以三人一排,五人一排,七人一排地变换队形,每次只需要看一眼队伍的队尾就知道人数了 
 * 
 * 输入包含多组数据,每组数据包含3个非负整数a,b,c.表示每种队形排尾的人数(a < 5, b < 5, c < 7),  
 * 输出总人数的最小值(或报告无解)
 * 已知总人数不小于10,不超过100
 * 输入到文件结束为止
 * 
 * 样例输入
 * 2 1 6
 * 2 1 3
 * 样例输出
 * Case 1: 41
 * Case No answer
 * 
 * 注:
 *    三人一排,五人一排和七人一排的含义
 *    即整数n分别整数3,5和7,得到余数,判断这个整数n是多少
 *    即寻找3,5,7的最小公倍数
 * *************************/
# include<cstdio>

int main(){
    int a, b, c;
    int Case = 0, i;

    scanf("%d%d%d", &a, &b, &c);
    getchar();

    for(i = 10; i <= 100; i++){
        if(i%3 == a && i%5 == b && i%7 == c){
            printf("Case %d: %d\n", ++Case, i);
        }
    }

    if(i == 101 && Case == 0){
        printf("Case No answer\n");
    }

    getchar();
    return 0;
}