/***************************
 * 输入正整数n(n <= 20) 输出一个n层的倒三角形
 * 例如 n = 5时
 * #########
 *  #######
 *   #####
 *    ###
 *     #
 * 分析1
 * 正整数为n时,倒三角形有n层
 * 第n层              2n-1个#
 * 第n-1层            2n-1-2个#
 * 第n-2层            2n-1-2-3个#
 * ...                ...
 * 第n - (n-2) = 2层  2n - 1 - 2 - 3-...-(n-2) - (n-1) = 3个#
 * 第n - (n-1) = 1层  2n - 1 - 2 - 3-...-(n-1) - n = 1个#
 * 即按奇数排列2i-1
 * 分析2
 * 为了方便,可以将左侧的空格加进来
 * 第n层   先打印0个空格, 然后是2n-1个#
 * 第n-1层 先打印1个空格, 然后是2n-1-2个#
 * ...
 * 第2层   先打印n-2个空格,然后是3个#
 * 第1层   先打印n-1个空格,然后是1个#
 * 即按自然数增加
 * *************************/

#include<cstdio>
int main(){
    int n;
    scanf("%d", &n);
    getchar();

    for(int i = n; i >=1; i--){
        for(int j = 0; j <= n - i; j++){
            printf(" ");
        }

        for(int j = 1 ; j <= 2*i-1; j++){
            printf("#");
        }

        printf("\n");
    }

    getchar();
    return 0;
}