/**********************************
 * 输入正整数a,b,c,输出a/b的小数形式,精确到小数点后c位.a,b <= 10^6, c <=100
 * 输入包含多组数据, 结束标记为a = b = c = 0;
 * 样例输入
 * 1 6 4
 * 0 0 0
 * 样例输出
 * Case 1: 0.1667
 * 
 * 分析
 * 由于c <= 100 , 显然利用已有的数据类型,其精度是不够的
 * 
 * 首先提取出a/b的整数部分
 * 对于余数部分,基本思想
 * 余数放大(*10),然后除(/b),获得第i位小数,接着取余(%b),如此循环,直到第c位,最后对第c+1位四舍五入
 * 与手算除法运算思想基本一致
 * 
 * 难点在于:
 * 怎么将人的思想或者说算法转化为程序语言
 * 
 * 待整理
 * *******************************/
# include<cstdio>
# include<cmath>

int main(){
    int a ,b ,c , k, kcase = 0;

    while(scanf("%d%d%d", &a,&b,&c) == 3 && a && b && c 
            && a < pow(10.0, 6.0) && b < pow(10.0, 6.0) && c <=100){
        printf("Case %d : %d.", ++kcase, a/b); // 输出整数部分
        
        k = a%b; // 取余,即小数部分

        for( ; c > 1; c--){
            k = k * 10; // k乘以10 ,小数点向右移动一位
            printf("%d", k/b);
            k = k%b; // 继续取余
        }

        k = k * 10;
        printf("%d\n", k/b >= 5 ? k/b + 1 : k/b); // c + 1位进行四舍五入
    }

    return 0;
}